config.org
#+TITLE: DinoDeadChompy's GNU Emacs Config
#+STARTUP: showeverything
#+OPTIONS: toc:2

* TABLE OF CONTENTS :toc:
- [[#important-packages-to-load][IMPORTANT PACKAGES TO LOAD]]
  - [[#load-components][Load Components]]
  - [[#load-evil-mode][Load Evil Mode]]
  - [[#generalel-for-keybindings][General.el for keybindings]]
  - [[#which-key][Which Key]]
  - [[#dired][Dired]]
  - [[#sudo-edit][Sudo Edit]]
  - [[#all-the-icons][All The Icons]]
  - [[#ivy-counsel][IVY (Counsel)]]
- [[#extra-packages][EXTRA PACKAGES]]
  - [[#dashboard][Dashboard]]
  - [[#eshell][Eshell]]
  - [[#diminish][Diminish]]
  - [[#projectile][Projectile]]
  - [[#flycheck][Flycheck]]
  - [[#company][Company]]
  - [[#git-stuff][Git Stuff]]
  - [[#highlight-todo][Highlight TODO]]
  - [[#vterm--vterm-toggle][Vterm & Vterm Toggle]]
  - [[#eat-terminal][Eat terminal]]
  - [[#rainbow-mode][Rainbow mode]]
- [[#language-support][Language Support]]
- [[#fonts][FONTS]]
  - [[#setting-the-default-font-family][Setting the default font family]]
- [[#general-emacs-tweaks][GENERAL EMACS TWEAKS]]
  - [[#disable-the-various-bars][Disable the various bars]]
  - [[#display-line-numbers-and-truncate-lines][Display line numbers and Truncate lines]]
  - [[#disable-backup-files][Disable Backup files]]
  - [[#enable-minibuffer-history][Enable minibuffer history]]
  - [[#enable-remembering-file-placement][Enable remembering file placement]]
  - [[#disable-ui-dialog-prompts][Disable UI dialog prompts]]
  - [[#enable-auto-buffer-reverting][Enable auto buffer reverting]]
  - [[#minibuffer-escape][Minibuffer Escape]]
- [[#theme][THEME]]
  - [[#modeline][Modeline]]
- [[#org-mode][ORG MODE]]
  - [[#enable-org-toc][Enable Org TOC]]
  - [[#enable-org-bullets][Enable Org Bullets]]
  - [[#disable-eletric-indent][Disable Eletric indent]]
  - [[#org-tempo][Org Tempo]]
  - [[#diminish-org-indent-mode][Diminish Org Indent Mode]]
  - [[#org-source-code-blocks][Org Source Code Blocks]]

* IMPORTANT PACKAGES TO LOAD
** Load Components
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/emacs/src")

(require 'elpaca-setup) ;; Loads the elpaca manager
(require 'buffer-move) ;; Loads the buffer move functions to allow easy moving of panes
(require 'app-launcher) ;; Loads the app launcher function for application launching
#+end_src

** Load Evil Mode
#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-intergration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  :config
  (define-key evil-normal-state-map (kbd "q") :ignore t)
  (evil-set-initial-state 'vterm-mode 'insert)
  (evil-set-initial-state 'eat-mode 'insert)
  (evil-mode))
  (use-package evil-collection
    :after evil
    :config
    (setq evil-collection-mode-list '(dashboard dired ibuffer))
    (evil-collection-init))

;; Using RETURN to follow links in Org/Evil 
;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil)
  (define-key evil-motion-state-map (kbd "TAB") nil))
;; Setting RETURN key in org-mode to follow links
  (setq org-return-follows-link  t)
#+end_src

** General.el for keybindings
#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup)

;; setup 'SPC' as the global leader key for Emacs
(general-create-definer ddc/leader-keys
  :states '(normal insert visual emacs)
  :keymaps 'override
  :prefix "SPC" ;; set the leader key
  :global-prefix "M-SPC") ;; set the leader key for all states no matter what

(ddc/leader-keys
  "SPC" '(counsel-M-x :wk "M-x shortcut")
  "." '(find-file :wk "Find file")
  "f c" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "Edit emacs config")
  "f r" '(counsel-recentf :wk "Find recent files")
  "TAB TAB" '(comment-line :wk "Comment lines"))

(ddc/leader-keys
    "b" '(:ignore t :wk "Bookmarks/Buffers")
    "b c" '(clone-indirect-buffer :wk "Create indirect buffer copy in a split")
    "b C" '(clone-indirect-buffer-other-window :wk "Clone indirect buffer in new window")
    "b d" '(bookmark-delete :wk "Delete bookmark")
    "b i" '(ibuffer :wk "Ibuffer")
    "b k" '(kill-this-buffer :wk "Kill this buffer")
    "b K" '(kill-some-buffers :wk "Kill multiple buffers")
    "b l" '(list-bookmarks :wk "List bookmarks")
    "b m" '(bookmark-set :wk "Set bookmark")
    "b n" '(next-buffer :wk "Next buffer")
    "b p" '(previous-buffer :wk "Previous buffer")
    "b r" '(revert-buffer :wk "Reload buffer")
    "b R" '(rename-buffer :wk "Rename buffer")
    "b s" '(basic-save-buffer :wk "Save buffer")
    "b S" '(save-some-buffers :wk "Save multiple buffers")
    "b w" '(bookmark-save :wk "Save current bookmarks to bookmark file"))

(ddc/leader-keys
  "d" '(:ignore t :wk "Dired")
  "d d" '(dired :wk "Open dired")
  "d j" '(dired-jump :wk "Dired jump to current")
  "d p" '(dired-preview-mode :wk "Dired preview"))

(ddc/leader-keys
  "e" '(:ignore t :wk "Evaluate")    
  "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
  "e d" '(eval-defun :wk "Evaluate defun containing or after point")
  "e e" '(eval-expression :wk "Evaluate and elisp expression")
  "e h" '(counsel-esh-history :which-key "Eshell history")
  "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
  "e r" '(eval-region :wk "Evaluate elisp in region") 
  "e s" '(eshell :which-key "Eshell"))

(ddc/leader-keys
  "h" '(:ignore t :wk "Help")
  "h a" '(counsel-apropos :wk "Apropos")
  "h b" '(describe-bindings :wk "Describe bindings")
  "h c" '(describe-char :wk "Describe character under cursor")
  "h d" '(:ignore t :wk "Emacs documentation")
  "h d a" '(about-emacs :wk "About Emacs")
  "h d d" '(view-emacs-debugging :wk "View Emacs debugging")
  "h d f" '(view-emacs-FAQ :wk "View Emacs FAQ")
  "h d m" '(info-emacs-manual :wk "The Emacs manual")
  "h d n" '(view-emacs-news :wk "View Emacs news")
  "h d o" '(describe-distribution :wk "How to obtain Emacs")
  "h d p" '(view-emacs-problems :wk "View Emacs problems")
  "h d t" '(view-emacs-todo :wk "View Emacs todo")
  "h d w" '(describe-no-warranty :wk "Describe no warranty")
  "h e" '(view-echo-area-messages :wk "View echo area messages")
  "h f" '(describe-function :wk "Describe function")
  "h F" '(describe-face :wk "Describe face")
  "h g" '(describe-gnu-project :wk "Describe GNU Project")
  "h i" '(info :wk "Info")
  "h I" '(describe-input-method :wk "Describe input method")
  "h k" '(describe-key :wk "Describe key")
  "h l" '(view-lossage :wk "Display recent keystrokes and the commands run")
  "h L" '(describe-language-environment :wk "Describe language environment")
  "h m" '(describe-mode :wk "Describe mode")
  "h p" '(elpaca-manager :wk "Elpaca Package Manager")
  "h r" '(:ignore t :wk "Reload")
  "h r r" '((lambda () (interactive)
              (load-file "~/.config/emacs/init.el")
              (ignore (elpaca-process-queues)))
            :wk "Reload emacs config")
  "h t" '(load-theme :wk "Load theme")
  "h v" '(describe-variable :wk "Describe variable")
  "h w" '(where-is :wk "Prints keybinding for command if set")
  "h x" '(describe-command :wk "Display full documentation for command"))

(ddc/leader-keys
  "o" '(:ignore t :wk "Org")
  "o a" '(org-agenda :wk "Org agenda")
  "o e" '(org-export-dispatch :wk "Org export dispatch")
  "o i" '(org-toggle-item :wk "Org toggle item")
  "o t" '(org-todo :wk "Org todo")
  "o B" '(org-babel-tangle :wk "Org babel tangle")
  "o T" '(org-todo-list :wk "Org todo list"))

(ddc/leader-keys
  "o b" '(:ignore t :wk "Tables")
  "o b -" '(org-table-insert-hline :wk "Insert hline in table"))

(ddc/leader-keys
  "o d" '(:ignore t :wk "Date/deadline")
  "o d t" '(org-time-stamp :wk "Org time stamp"))

(ddc/leader-keys
  "p" '(projectile-command-map :wk "Projectile"))

(ddc/leader-keys
  "t" '(:ignore t :wk "Toggle")
  "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
  "t t" '(visual-line-mode :wk "Toggle truncated lines")
  "t v" '(vterm-toggle :wk "Toggle vterm"))

(ddc/leader-keys
  "w" '(:ignore t :wk "Windows")
  ;; Window splits
  "w c" '(evil-window-delete :wk "Close window")
  "w n" '(evil-window-new :wk "New window")
  "w s" '(evil-window-split :wk "Horizontal split window")
  "w v" '(evil-window-vsplit :wk "Vertical split window")
  ;; Window motions
  "w h" '(evil-window-left :wk "Window left")
  "w j" '(evil-window-down :wk "Window down")
  "w k" '(evil-window-up :wk "Window up")
  "w l" '(evil-window-right :wk "Window right")
  "w w" '(evil-window-next :wk "Goto next window")
  ;; Move Windows
  "w H" '(buf-move-left :wk "Buffer move left")
  "w J" '(buf-move-down :wk "Buffer move down")
  "w K" '(buf-move-up :wk "Buffer move up")
  "w L" '(buf-move-right :wk "Buffer move right"))
)
#+end_src

