config.org
** Setting the default font family
#+begin_src emacs-lisp

;; Primary font for most things
(set-face-attribute 'default nil
  :font "JetBrains Mono"
  :height 110
  :weight 'medium)

;; Sets the font for non text editing buffers
(set-face-attribute 'variable-pitch nil
  :font "Noto Sans"
  :height 120
  :weight 'medium)
(set-face-attribute 'fixed-pitch nil
  :font "JetBrains Mono"
  :height 110
  :weight 'medium)

;; Makes commented text and keywords italic
;; Doesn't work in normal Emacs on the client version
(set-face-attribute 'font-lock-comment-face nil
  :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
  :slant 'italic)

;; This sets the default font on all graphical frames created after restarted Emacs
;; Does the same thing as 'set-face-attribute default'
(add-to-list 'default-frame-alist '(font . "JetBrains Mono-11"))

;; Adjusts line spacing
(setq-default line-spacing 0.12)

#+end_src


* GENERAL EMACS TWEAKS

** Disable the various bars
#+begin_src emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Display line numbers and Truncate lines
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+end_src

** Disable Backup files
#+begin_src emacs-lisp
(setq make-backup-files nil) ; stop creating ~ files
#+end_src

** Enable minibuffer history
#+begin_src emacs-lisp
(setq history-length 25)
(savehist-mode 1)
#+end_src

** Enable remembering file placement
#+begin_src emacs-lisp
(save-place-mode 1)
#+end_src

** Disable UI dialog prompts
#+begin_src emacs-lisp
(setq use-dialog-box nil)
#+end_src

** Enable auto buffer reverting 
#+begin_src emacs-lisp
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+end_src

** Minibuffer Escape
#+begin_src emacs-lisp
(global-set-key [escape] 'keyboard-escape-quit)
#+end_src


* THEME
#+begin_src emacs-lisp
    ;;(add-to-list 'custom-theme-load-path "~/.config/emacs/themes/")
    ;;(load-theme 'dinomacs t)
(use-package doom-themes
  :ensure t
  :config
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled

  (load-theme 'doom-tokyo-night t)
  (doom-themes-org-config))
#+end_src

** Modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config
  (setq doom-modeline-height 30      ;; sets modeline height
        doom-modeline-bar-width 5    ;; sets right bar width
        doom-modeline-persp-name t   ;; adds perspective name to modeline
        doom-modeline-persp-icon t)) ;; adds folder icon next to persp name
#+end_src


* ORG MODE
** Enable Org TOC
#+begin_src emacs-lisp
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Enable Org Bullets
Replaces the asterisks in org documents with bullets

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

** Disable Eletric indent
#+begin_src emacs-lisp
(electric-indent-mode -1)
(setq org-edit-src-content-indentation 0)
#+end_src

** Org Tempo
| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |

#+begin_src emacs-lisp
(require 'org-tempo)
#+end_src

** Diminish Org Indent Mode
#+begin_src emacs-lisp
(eval-after-load 'org-indent '(diminish 'org-indent-mode))
#+end_src

** Org Source Code Blocks
#+begin_src emacs-lisp
  (custom-set-faces
      '(org-block ((t ( :background nil))))
      '(org-block-begin-line ((t ( :background nil))))
      '(org-block-end-line ((t ( :background nil)))))
#+end_src

