config.el

;; Primary font for most things
(set-face-attribute 'default nil
  :font "JetBrains Mono"
  :height 110
  :weight 'medium)

;; Sets the font for non text editing buffers
(set-face-attribute 'variable-pitch nil
  :font "Noto Sans"
  :height 120
  :weight 'medium)
(set-face-attribute 'fixed-pitch nil
  :font "JetBrains Mono"
  :height 110
  :weight 'medium)

;; Makes commented text and keywords italic
;; Doesn't work in normal Emacs on the client version
(set-face-attribute 'font-lock-comment-face nil
  :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
  :slant 'italic)

;; This sets the default font on all graphical frames created after restarted Emacs
;; Does the same thing as 'set-face-attribute default'
(add-to-list 'default-frame-alist '(font . "JetBrains Mono-11"))

;; Adjusts line spacing
(setq-default line-spacing 0.12)

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

(global-display-line-numbers-mode 1)
(global-visual-line-mode t)

(setq make-backup-files nil) ; stop creating ~ files

(setq history-length 25)
(savehist-mode 1)

(save-place-mode 1)

(setq use-dialog-box nil)

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)

(global-set-key [escape] 'keyboard-escape-quit)

;;(add-to-list 'custom-theme-load-path "~/.config/emacs/themes/")
    ;;(load-theme 'dinomacs t)
(use-package doom-themes
  :ensure t
  :config
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled

  (load-theme 'doom-tokyo-night t)
  (doom-themes-org-config))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config
  (setq doom-modeline-height 30      ;; sets modeline height
        doom-modeline-bar-width 5    ;; sets right bar width
        doom-modeline-persp-name t   ;; adds perspective name to modeline
        doom-modeline-persp-icon t)) ;; adds folder icon next to persp name

(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

(electric-indent-mode -1)
(setq org-edit-src-content-indentation 0)

(require 'org-tempo)

(eval-after-load 'org-indent '(diminish 'org-indent-mode))

(custom-set-faces
    '(org-block ((t ( :background nil))))
    '(org-block-begin-line ((t ( :background nil))))
    '(org-block-end-line ((t ( :background nil)))))
